# Fundamentals Introduction

### Contents
- Object Creation
- Viewing Data
- Selection
    - Getting 
    - Selection by Label 
    - Selection by Position 
- Boolean Indexing
- Setting (PENDING)
- Missing Data
- Operations 
    - Stats 
    - Apply
    - Histogramming 
    - String Methods
- Merge [This topic is huge and need its own section]
    - Concat
    - Join
    - Append 
- Grouping 
    - Splitting 
    - Applying 
    - Combining
- Reshaping 
    - Stack 
    - Unstack 
- Pivot Tables
- Timeseries 
- Categorical
- Plotting
- Getting Data in/out

In [1]:
import numpy as np
import pandas as pd

## 1. Object Creation
- Question: How to create Series and DataFrame? 
- Answer: Both Series and Dataframe can be create using:
    - numpy array (ndarray)
    - Dictionaries 
    - Scalars

###  Creating a Series by passing list of values
- Series is a one dimmensional container of scalars. It can hold any data types.
- s = pd.Series(data, index).
- index is optional, however, pandas will create a default index

In [10]:
s = pd.Series([1,3,4,np.nan,6,7])

In [4]:
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    7.0
dtype: float64

### Creating a Dataframe by passing Numpy Array, with labeled columns and dates as index

In [8]:
dates = pd.date_range('20190101', periods=6)
dates

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2019-01-01  0.839231 -1.061113 -0.626078 -1.252577
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969
2019-01-03  1.009431  0.141091  1.447420  0.125754
2019-01-04  1.413354 -1.092345 -1.468236 -0.194967
2019-01-05  0.028326 -1.223371 -1.342722 -0.538534
2019-01-06 -1.217655 -1.347822 -1.420383 -0.126034

In [13]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

### Creating a Dataframe by passing Dictionary, with labeled columns and dates as index

In [17]:
dict = {'Fruits': ["Apple", "Bannan", "Canteleoup", "Dewberries"], "Kilos" : pd.Series([3,44,6,11]),'sample': pd.Categorical(["test", "train", "test", "train"]) }

dict_df = pd.DataFrame(dict)

dict_df

       Fruits  Kilos sample
0       Apple      3   test
1      Bannan     44  train
2  Canteleoup      6   test
3  Dewberries     11  train

In [19]:
dict_df.dtypes

Fruits      object
Kilos        int64
sample    category
dtype: object

## 2. Viewing Data

In [21]:
df.head()

                   A         B         C         D
2019-01-01  0.839231 -1.061113 -0.626078 -1.252577
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969
2019-01-03  1.009431  0.141091  1.447420  0.125754
2019-01-04  1.413354 -1.092345 -1.468236 -0.194967
2019-01-05  0.028326 -1.223371 -1.342722 -0.538534

In [23]:
df.tail()

                   A         B         C         D
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969
2019-01-03  1.009431  0.141091  1.447420  0.125754
2019-01-04  1.413354 -1.092345 -1.468236 -0.194967
2019-01-05  0.028326 -1.223371 -1.342722 -0.538534
2019-01-06 -1.217655 -1.347822 -1.420383 -0.126034

In [26]:
df.index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

In [27]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.409594 -1.024218 -0.724335 -0.493554
std    0.932292  0.599544  1.112767  0.532479
min   -1.217655 -1.561748 -1.468236 -1.252577
25%    0.117463 -1.316709 -1.400968 -0.865860
50%    0.612054 -1.157858 -1.139366 -0.366750
75%    0.966881 -1.068921 -0.703561 -0.143267
max    1.413354  0.141091  1.447420  0.125754

##### TRANSPOSE

In [28]:
 df.T

   2019-01-01  2019-01-02  2019-01-03  2019-01-04  2019-01-05  2019-01-06
A    0.839231    0.384877    1.009431    1.413354    0.028326   -1.217655
B   -1.061113   -1.561748    0.141091   -1.092345   -1.223371   -1.347822
C   -0.626078   -0.936011    1.447420   -1.468236   -1.342722   -1.420383
D   -1.252577   -0.974969    0.125754   -0.194967   -0.538534   -0.126034

##### Sorting by an axis:

In [30]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2019-01-01 -1.252577 -0.626078 -1.061113  0.839231
2019-01-02 -0.974969 -0.936011 -1.561748  0.384877
2019-01-03  0.125754  1.447420  0.141091  1.009431
2019-01-04 -0.194967 -1.468236 -1.092345  1.413354
2019-01-05 -0.538534 -1.342722 -1.223371  0.028326
2019-01-06 -0.126034 -1.420383 -1.347822 -1.217655

In [31]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2019-01-01  0.839231 -1.061113 -0.626078 -1.252577
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969
2019-01-03  1.009431  0.141091  1.447420  0.125754
2019-01-04  1.413354 -1.092345 -1.468236 -0.194967
2019-01-05  0.028326 -1.223371 -1.342722 -0.538534
2019-01-06 -1.217655 -1.347822 -1.420383 -0.126034

In [35]:
df.sort_values(by = ['A'])

                   A         B         C         D
2019-01-06 -1.217655 -1.347822 -1.420383 -0.126034
2019-01-05  0.028326 -1.223371 -1.342722 -0.538534
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969
2019-01-01  0.839231 -1.061113 -0.626078 -1.252577
2019-01-03  1.009431  0.141091  1.447420  0.125754
2019-01-04  1.413354 -1.092345 -1.468236 -0.194967

In [37]:
df.sort_values(by = ['A','D'], ascending=False)

                   A         B         C         D
2019-01-04  1.413354 -1.092345 -1.468236 -0.194967
2019-01-03  1.009431  0.141091  1.447420  0.125754
2019-01-01  0.839231 -1.061113 -0.626078 -1.252577
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969
2019-01-05  0.028326 -1.223371 -1.342722 -0.538534
2019-01-06 -1.217655 -1.347822 -1.420383 -0.126034

## 3. Getting

In [38]:
# Selecting a single column, which yields a Series, equivalent to df.A:

df['A']

2019-01-01    0.839231
2019-01-02    0.384877
2019-01-03    1.009431
2019-01-04    1.413354
2019-01-05    0.028326
2019-01-06   -1.217655
Freq: D, Name: A, dtype: float64

In [39]:
# Selecting via [], which slices the rows.

df[0:3]

                   A         B         C         D
2019-01-01  0.839231 -1.061113 -0.626078 -1.252577
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969
2019-01-03  1.009431  0.141091  1.447420  0.125754

In [45]:
df[0:4]

                   A         B         C         D
2019-01-01  0.839231 -1.061113 -0.626078 -1.252577
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969
2019-01-03  1.009431  0.141091  1.447420  0.125754
2019-01-04  1.413354 -1.092345 -1.468236 -0.194967

In [53]:
df.index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

#### Selection by label df.loc[  ]

In [55]:
df.loc[:,['A','D']]

                   A         D
2019-01-01  0.839231 -1.252577
2019-01-02  0.384877 -0.974969
2019-01-03  1.009431  0.125754
2019-01-04  1.413354 -0.194967
2019-01-05  0.028326 -0.538534
2019-01-06 -1.217655 -0.126034

In [57]:
df.loc['2019-01-01':'2019-01-03',['A','D']]

                   A         D
2019-01-01  0.839231 -1.252577
2019-01-02  0.384877 -0.974969
2019-01-03  1.009431  0.125754

In [60]:
df.loc['2019-01-01':'2019-01-03','D']

2019-01-01   -1.252577
2019-01-02   -0.974969
2019-01-03    0.125754
Freq: D, Name: D, dtype: float64

In [62]:
df.loc[:,['A','C']]

                   A         C
2019-01-01  0.839231 -0.626078
2019-01-02  0.384877 -0.936011
2019-01-03  1.009431  1.447420
2019-01-04  1.413354 -1.468236
2019-01-05  0.028326 -1.342722
2019-01-06 -1.217655 -1.420383

In [63]:
df.loc['2019-01-01',:]

A    0.839231
B   -1.061113
C   -0.626078
D   -1.252577
Name: 2019-01-01 00:00:00, dtype: float64

In [66]:
df.loc['2019-01-01':'2019-01-05',['A','D','B']]

                   A         D         B
2019-01-01  0.839231 -1.252577 -1.061113
2019-01-02  0.384877 -0.974969 -1.561748
2019-01-03  1.009431  0.125754  0.141091
2019-01-04  1.413354 -0.194967 -1.092345
2019-01-05  0.028326 -0.538534 -1.223371

#### Selection by position df.iloc[  ]

In [68]:
df.iloc[0:4, 0:2]

                   A         B
2019-01-01  0.839231 -1.061113
2019-01-02  0.384877 -1.561748
2019-01-03  1.009431  0.141091
2019-01-04  1.413354 -1.092345

In [73]:
df.iloc[0:3,0:4]

                   A         B         C         D
2019-01-01  0.839231 -1.061113 -0.626078 -1.252577
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969
2019-01-03  1.009431  0.141091  1.447420  0.125754

In [74]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2019-01-02  0.384877 -0.936011
2019-01-03  1.009431  1.447420
2019-01-05  0.028326 -1.342722

#### Boolean Indexing

In [75]:
df[df.A > 0]

                   A         B         C         D
2019-01-01  0.839231 -1.061113 -0.626078 -1.252577
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969
2019-01-03  1.009431  0.141091  1.447420  0.125754
2019-01-04  1.413354 -1.092345 -1.468236 -0.194967
2019-01-05  0.028326 -1.223371 -1.342722 -0.538534

In [76]:
df[df['A']>0]

                   A         B         C         D
2019-01-01  0.839231 -1.061113 -0.626078 -1.252577
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969
2019-01-03  1.009431  0.141091  1.447420  0.125754
2019-01-04  1.413354 -1.092345 -1.468236 -0.194967
2019-01-05  0.028326 -1.223371 -1.342722 -0.538534

In [78]:
df[(df['A'] > 0) & (df['B'] > 0)]

                   A         B        C         D
2019-01-03  1.009431  0.141091  1.44742  0.125754

In [87]:
df2 =df.copy()
df2['E'] = ['one', 'two', 'three', 'four', 'five', 'nine']
df2

                   A         B         C         D      E
2019-01-01  0.839231 -1.061113 -0.626078 -1.252577    one
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969    two
2019-01-03  1.009431  0.141091  1.447420  0.125754  three
2019-01-04  1.413354 -1.092345 -1.468236 -0.194967   four
2019-01-05  0.028326 -1.223371 -1.342722 -0.538534   five
2019-01-06 -1.217655 -1.347822 -1.420383 -0.126034   nine

In [88]:
# I need all of the dataframe based on the column E with the specific values. 
df2[df2['E'].isin(['two','three'])]

                   A         B         C         D      E
2019-01-02  0.384877 -1.561748 -0.936011 -0.974969    two
2019-01-03  1.009431  0.141091  1.447420  0.125754  three

## 4. Setting

## 5. Missing Data

In [89]:
data = pd.read_csv('nba.csv')

In [91]:
type(data)

pandas.core.frame.DataFrame

In [93]:
data2 = data.sample(frac =.10)

In [97]:
data2.shape

(46, 9)

In [99]:
# Where is the missing values in the dataframe 
data2[data2.isna().any(axis=1)]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
156,Pau Gasol,Chicago Bulls,16,C,35,Jul-00,250,NaN,7448760.0
118,Louis Williams,Los Angeles Lakers,23,SG,29,1-Jun,175,NaN,7000000.0
211,Giannis Antetokounmpo,Milwaukee Bucks,34,SF,21,11-Jun,222,NaN,1953960.0
391,Joffrey Lauvergne,Denver Nuggets,77,C,24,11-Jun,220,NaN,1709719.0
455,Tibor Pleiss,Utah Jazz,21,C,26,3-Jul,256,NaN,2900000.0
292,Kendrick Perkins,New Orleans Pelicans,5,C,31,10-Jun,270,NaN,947276.0
176,Timofey Mozgov,Cleveland Cavaliers,20,C,29,1-Jul,275,NaN,4950000.0
90,Anderson Varejao,Golden State Warriors,18,PF,33,11-Jun,273,NaN,289755.0
169,LeBron James,Cleveland Cavaliers,23,SF,31,8-Jun,250,NaN,22970500.0
217,Damien Inglis,Milwaukee Bucks,17,SF,21,8-Jun,246,NaN,855000.0
270,Xavier Munford,Memphis Grizzlies,14,PG,24,3-Jun,180,Rhode Island,NaN
112,Marcelo Huertas,Los Angeles Lakers,9,PG,33,3-Jun,200,NaN,525093.0
15,Bojan Bogdanovic,Brooklyn Nets,44,SG,27,8-Jun,216,NaN,3425510.0

In [100]:
data2.fillna('Vijay')

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
156,Pau Gasol,Chicago Bulls,16,C,35,Jul-00,250,Vijay,7.44876e+06
436,Damian Lillard,Portland Trail Blazers,0,PG,25,3-Jun,195,Weber State,4.23629e+06
248,Andrew Goudelock,Houston Rockets,0,PG,27,3-Jun,200,Charleston,200600
441,Noah Vonleh,Portland Trail Blazers,21,PF,20,9-Jun,240,Indiana,2.63772e+06
118,Louis Williams,Los Angeles Lakers,23,SG,29,1-Jun,175,Vijay,7e+06
97,Wesley Johnson,Los Angeles Clippers,33,SF,28,7-Jun,215,Syracuse,1.1006e+06
211,Giannis Antetokounmpo,Milwaukee Bucks,34,SF,21,11-Jun,222,Vijay,1.95396e+06
391,Joffrey Lauvergne,Denver Nuggets,77,C,24,11-Jun,220,Vijay,1.70972e+06
455,Tibor Pleiss,Utah Jazz,21,C,26,3-Jul,256,Vijay,2.9e+06
364,Elfrid Payton,Orlando Magic,4,PG,22,4-Jun,185,Louisiana-Lafayette,2.50572e+06
208,Myles Turner,Indiana Pacers,33,PF,20,11-Jun,243,Texas,2.35776e+06
292,Kendrick Perkins,New Orleans Pelicans,5,C,31,10-Jun,270,Vijay,947276
176,Timofey Mozgov,Cleveland Cavaliers,20,C,29,1-Jul,275,Vijay,4.95e+06
307,Jonathon Simmons,San Antonio Spurs,17,SG,26,6-Jun,195,Houston,525093
90,Anderson Varejao,Golden State Warriors,18,PF,33,11-Jun,273,Vijay,289755
82,Draymond Green,Golden State Warriors,23,PF,26,7-Jun,230,Michigan State,1.42609e+07
168,Kyrie Irving,Cleveland Cavaliers,2,PG,24,3-Jun,193,Duke,1.64075e+07
161,E'Twaun Moore,Chicago Bulls,55,SG,27,4-Jun,191,Purdue,1.01542e+06
242,Trevor Ariza,Houston Rockets,1,SF,30,8-Jun,215,UCLA,8.19303e+06
169,LeBron James,Cleveland Cavaliers,23,SF,31,8-Jun,250,Vijay,2.29705e+07
42,Lance Thomas,New York Knicks,42,SF,28,8-Jun,235,Duke,1.63684e+06
217,Damien Inglis,Milwaukee Bucks,17,SF,21,8-Jun,246,Vijay,855000
64,DeMar DeRozan,Toronto Raptors,10,SG,26,7-Jun,220,USC,1.005e+07
73,Jason Thompson,Toronto Raptors,1,PF,29,11-Jun,250,Rider,245177
270,Xavier Munford,Memphis Grizzlies,14,PG,24,3-Jun,180,Rhode Island,Vijay
433,Gerald Henderson,Portland Trail Blazers,9,SG,28,5-Jun,215,Duke,6e+06
384,D.J. Augustin,Denver Nuggets,12,PG,28,Jun-00,183,Texas,3e+06
337,Marvin Williams,Charlotte Hornets,2,PF,29,9-Jun,237,North Carolina,7e+06
414,Kevin Durant,Oklahoma City Thunder,35,SF,27,9-Jun,240,Texas,2.01586e+07
101,Paul Pierce,Los Angeles Clippers,34,SF,38,7-Jun,235,Kansas,3.376e+06
98,DeAndre Jordan,Los Angeles Clippers,6,C,27,11-Jun,265,Texas A&M,1.9689e+07
206,Glenn Robinson III,Indiana Pacers,40,SG,22,7-Jun,222,Michigan,1.1e+06
202,Solomon Hill,Indiana Pacers,44,SF,25,7-Jun,225,Arizona,1.35888e+06
149,Eric Moreland,Sacramento Kings,25,PF,24,10-Jun,238,Oregon State,845059
9,Marcus Smart,Boston Celtics,36,PG,22,4-Jun,220,Oklahoma State,3.43104e+06
133,P.J. Tucker,Phoenix Suns,17,SF,31,6-Jun,245,Texas,5.5e+06
203,Ty Lawson,Indiana Pacers,10,PG,28,11-May,195,North Carolina,211744
112,Marcelo Huertas,Los Angeles Lakers,9,PG,33,3-Jun,200,Vijay,525093
261,Vince Carter,Memphis Grizzlies,15,SG,39,6-Jun,220,North Carolina,4.08802e+06
240,Charlie Villanueva,Dallas Mavericks,3,PF,31,11-Jun,232,Connecticut,947276
218,O.J. Mayo,Milwaukee Bucks,3,SG,28,5-Jun,210,USC,8e+06
249,James Harden,Houston Rockets,13,SG,26,5-Jun,220,Arizona State,1.57564e+07
192,Stanley Johnson,Detroit Pistons,3,SF,20,7-Jun,245,Arizona,2.84196e+06
15,Bojan Bogdanovic,Brooklyn Nets,44,SG,27,8-Jun,216,Vijay,3.42551e+06
92,Jeff Ayres,Los Angeles Clippers,19,PF,29,9-Jun,250,Arizona State,111444
267,P.J. Hairston,Memphis Grizzlies,19,SF,23,6-Jun,230,North Carolina,1.20144e+06

In [103]:
#To drop any rows that have missing data.


sample_data = data2.dropna(how='any')
sample_data

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
436,Damian Lillard,Portland Trail Blazers,0,PG,25,3-Jun,195,Weber State,4236287.0
248,Andrew Goudelock,Houston Rockets,0,PG,27,3-Jun,200,Charleston,200600.0
441,Noah Vonleh,Portland Trail Blazers,21,PF,20,9-Jun,240,Indiana,2637720.0
97,Wesley Johnson,Los Angeles Clippers,33,SF,28,7-Jun,215,Syracuse,1100602.0
364,Elfrid Payton,Orlando Magic,4,PG,22,4-Jun,185,Louisiana-Lafayette,2505720.0
208,Myles Turner,Indiana Pacers,33,PF,20,11-Jun,243,Texas,2357760.0
307,Jonathon Simmons,San Antonio Spurs,17,SG,26,6-Jun,195,Houston,525093.0
82,Draymond Green,Golden State Warriors,23,PF,26,7-Jun,230,Michigan State,14260870.0
168,Kyrie Irving,Cleveland Cavaliers,2,PG,24,3-Jun,193,Duke,16407501.0
161,E'Twaun Moore,Chicago Bulls,55,SG,27,4-Jun,191,Purdue,1015421.0
242,Trevor Ariza,Houston Rockets,1,SF,30,8-Jun,215,UCLA,8193030.0
42,Lance Thomas,New York Knicks,42,SF,28,8-Jun,235,Duke,1636842.0
64,DeMar DeRozan,Toronto Raptors,10,SG,26,7-Jun,220,USC,10050000.0
73,Jason Thompson,Toronto Raptors,1,PF,29,11-Jun,250,Rider,245177.0
433,Gerald Henderson,Portland Trail Blazers,9,SG,28,5-Jun,215,Duke,6000000.0
384,D.J. Augustin,Denver Nuggets,12,PG,28,Jun-00,183,Texas,3000000.0
337,Marvin Williams,Charlotte Hornets,2,PF,29,9-Jun,237,North Carolina,7000000.0
414,Kevin Durant,Oklahoma City Thunder,35,SF,27,9-Jun,240,Texas,20158622.0
101,Paul Pierce,Los Angeles Clippers,34,SF,38,7-Jun,235,Kansas,3376000.0
98,DeAndre Jordan,Los Angeles Clippers,6,C,27,11-Jun,265,Texas A&M,19689000.0
206,Glenn Robinson III,Indiana Pacers,40,SG,22,7-Jun,222,Michigan,1100000.0
202,Solomon Hill,Indiana Pacers,44,SF,25,7-Jun,225,Arizona,1358880.0
149,Eric Moreland,Sacramento Kings,25,PF,24,10-Jun,238,Oregon State,845059.0
9,Marcus Smart,Boston Celtics,36,PG,22,4-Jun,220,Oklahoma State,3431040.0
133,P.J. Tucker,Phoenix Suns,17,SF,31,6-Jun,245,Texas,5500000.0
203,Ty Lawson,Indiana Pacers,10,PG,28,11-May,195,North Carolina,211744.0
261,Vince Carter,Memphis Grizzlies,15,SG,39,6-Jun,220,North Carolina,4088019.0
240,Charlie Villanueva,Dallas Mavericks,3,PF,31,11-Jun,232,Connecticut,947276.0
218,O.J. Mayo,Milwaukee Bucks,3,SG,28,5-Jun,210,USC,8000000.0
249,James Harden,Houston Rockets,13,SG,26,5-Jun,220,Arizona State,15756438.0
192,Stanley Johnson,Detroit Pistons,3,SF,20,7-Jun,245,Arizona,2841960.0
92,Jeff Ayres,Los Angeles Clippers,19,PF,29,9-Jun,250,Arizona State,111444.0
267,P.J. Hairston,Memphis Grizzlies,19,SF,23,6-Jun,230,North Carolina,1201440.0

## Operations

In [115]:
pd.set_option('display.float_format', lambda x: '%.3f' % x)
sample_data.mean()

Number        17.788
Age           26.758
Weight       222.242
Salary   5151198.333
dtype: float64

## Merge

### Concat

pandas.concat takes a list or dict of homogeneously-typed objects and concatenates them with some configurable handling of what to do with the other axes:

In [117]:
# My Data
df = pd.DataFrame(np.random.randn(10, 4))
df

       0      1      2      3
0  0.240  0.536 -1.903 -1.579
1 -0.374  0.556  0.054  0.569
2 -0.799  0.119 -0.541 -0.500
3  0.900 -1.458 -1.291 -0.000
4  0.505 -0.673  0.002  0.106
5 -1.214  0.218  0.707  1.035
6  0.210  0.255 -0.476  0.020
7  0.060  1.054 -0.068 -1.806
8  0.882 -0.241  1.195  0.006
9 -0.010  0.712  0.497 -0.736

In [130]:
# Subset of above data
test1 = df[3:7]
test1

       0      1      2      3
3  0.900 -1.458 -1.291 -0.000
4  0.505 -0.673  0.002  0.106
5 -1.214  0.218  0.707  1.035
6  0.210  0.255 -0.476  0.020

In [131]:
# Subset of above data
test2 = df[0:2]
test2

       0     1      2      3
0  0.240 0.536 -1.903 -1.579
1 -0.374 0.556  0.054  0.569

In [133]:
# Conctating two subsets across rows 
pd.concat([test1,test2])

       0      1      2      3
3  0.900 -1.458 -1.291 -0.000
4  0.505 -0.673  0.002  0.106
5 -1.214  0.218  0.707  1.035
6  0.210  0.255 -0.476  0.020
0  0.240  0.536 -1.903 -1.579
1 -0.374  0.556  0.054  0.569

In [143]:
pd.concat([test2,test1])

       0      1      2      3
0  0.240  0.536 -1.903 -1.579
1 -0.374  0.556  0.054  0.569
3  0.900 -1.458 -1.291 -0.000
4  0.505 -0.673  0.002  0.106
5 -1.214  0.218  0.707  1.035
6  0.210  0.255 -0.476  0.020

In [146]:
result = pd.concat([test2,test1], keys = ['x','y'])

In [147]:
result.loc['y']

       0      1      2      3
3  0.900 -1.458 -1.291 -0.000
4  0.505 -0.673  0.002  0.106
5 -1.214  0.218  0.707  1.035
6  0.210  0.255 -0.476  0.020

In [136]:
# Conctating two subsets across columns 
pd.concat([test2,test1], axis=1)

       0     1      2      3      0      1      2      3
0  0.240 0.536 -1.903 -1.579    nan    nan    nan    nan
1 -0.374 0.556  0.054  0.569    nan    nan    nan    nan
3    nan   nan    nan    nan  0.900 -1.458 -1.291 -0.000
4    nan   nan    nan    nan  0.505 -0.673  0.002  0.106
5    nan   nan    nan    nan -1.214  0.218  0.707  1.035
6    nan   nan    nan    nan  0.210  0.255 -0.476  0.020

### Merge

The fundamental idea that behind the join that there is one column (a primary key) on which you want to join two data sets.

In [148]:
left = pd.DataFrame({
    'Grain':['K0','K1','K2','K3'],
    'Column1': ['A0','A1','A2','A3'],
    'Column2': ['B0','B1','B2','B3']
})

left

  Grain Column1 Column2
0    K0      A0      B0
1    K1      A1      B1
2    K2      A2      B2
3    K3      A3      B3

In [150]:
right = pd.DataFrame({
    'Grain':['K0','K1','K2','K3'],
    'Column3': ['C0','C1','C2','C3'],
    'Column4': ['D0','D1','D2','D3']
})
right

  Grain Column3 Column4
0    K0      C0      D0
1    K1      C1      D1
2    K2      C2      D2
3    K3      C3      D3

In [153]:
result = pd.merge(left, right, on = 'Grain')
result

  Grain Column1 Column2 Column3 Column4
0    K0      A0      B0      C0      D0
1    K1      A1      B1      C1      D1
2    K2      A2      B2      C2      D2
3    K3      A3      B3      C3      D3

In [156]:
left = pd.DataFrame({
    'Grain1':['K0','K1','K2','K3'],
    'Grain2':['G0','G1','G2','G3'],
    'Column1': ['A0','A1','A2','A3'],
    'Column2': ['B0','B1','B2','B3']
})
left

  Grain1 Grain2 Column1 Column2
0     K0     G0      A0      B0
1     K1     G1      A1      B1
2     K2     G2      A2      B2
3     K3     G3      A3      B3

In [160]:
right = pd.DataFrame({
    'Grain1':['K0','K1','K2','K3'],
    'Grain2':['G0','G1','G3','G5'],
    'Column3': ['C0','C1','C2','C3'],
    'Column4': ['D0','D1','D2','D3']
})
right

  Grain1 Grain2 Column3 Column4
0     K0     G0      C0      D0
1     K1     G1      C1      D1
2     K2     G3      C2      D2
3     K3     G5      C3      D3

In [164]:
result = pd.merge(left, right, how='inner', on=['Grain1', 'Grain2'])
result

  Grain1 Grain2 Column1 Column2 Column3 Column4
0     K0     G0      A0      B0      C0      D0
1     K1     G1      A1      B1      C1      D1

In [166]:
result = pd.merge(left, right, how='outer', on=['Grain1', 'Grain2'])
result

  Grain1 Grain2 Column1 Column2 Column3 Column4
0     K0     G0      A0      B0      C0      D0
1     K1     G1      A1      B1      C1      D1
2     K2     G2      A2      B2     NaN     NaN
3     K3     G3      A3      B3     NaN     NaN
4     K2     G3     NaN     NaN      C2      D2
5     K3     G5     NaN     NaN      C3      D3

### Join 

DataFrame.join() is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

### Grouping

By group by we are referring to a process involving one or more of the following steps:

- Splitting the data into groups based on some criteria
- Applying a function to each group independently
- Combining the results into a data structure

Basically, group by categorical variables and numerical operations on the rest.

In [185]:
raw_data = pd.read_csv('nba.csv')
raw_data.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.000
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.000
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,nan
3,R.J. Hunter,Boston Celtics,28,SG,22,5-Jun,185,Georgia State,1148640.000
4,Jonas Jerebko,Boston Celtics,8,PF,29,10-Jun,231,NaN,5000000.000

In [194]:
data = raw_data.groupby(['College', 'Team']).sum()
data.head(10)

                               Number  Age  Weight       Salary
College Team
Alabama Cleveland Cavaliers        52   33     198  2100000.000
        Memphis Grizzlies           0   25     227   845059.000
        New Orleans Pelicans       15   29     225  1320000.000
Arizona Brooklyn Nets              24   21     220  1335480.000
        Cleveland Cavaliers        33   68     488  9140305.000
        Detroit Pistons             3   20     245  2841960.000
        Golden State Warriors       9   32     215 11710456.000
        Houston Rockets            31   38     185   947276.000
        Indiana Pacers             71   53     460  5358880.000
        Milwaukee Bucks            19   27     200  3000000.000